src/main/webapp/WEB-INF/wsdl/intimation_wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
	name="IntimationWS" targetNamespace="http://www.icicibank.com/ws/intimation"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
	xmlns:tns="http://www.icicibank.com/ws/intimation"
	xmlns:api="http://www.icicibank.com/api/acme"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<wsdl:types>
		<xsd:schema targetNamespace="http://www.icicibank.com/api/acme">
			<xsd:include schemaLocation="../xsd/intimation.xsd"/>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="IntimationRequest">
		<wsdl:part element="api:intimation_request" name="IntimationRequest" />
	</wsdl:message>
	<wsdl:message name="IntimationResponse">
		<wsdl:part element="api:intimation_response" name="IntimationResponse" />
	</wsdl:message>
	<wsdl:message name="RefundIntimationRequest">
		<wsdl:part element="api:refund_intimation_request" name="RefundIntimationRequest" />
	</wsdl:message>
	<wsdl:message name="RefundIntimationResponse">
		<wsdl:part element="api:refund_intimation_response" name="RefundIntimationResponse" />
	</wsdl:message>
	<wsdl:portType name="IntimationPort">
		<wsdl:operation name="Intimate">
			<wsdl:input message="tns:IntimationRequest" />
			<wsdl:output message="tns:IntimationResponse" />
		</wsdl:operation>
		<wsdl:operation name="RefundIntimate">
			<wsdl:input message="tns:RefundIntimationRequest" />
			<wsdl:output message="tns:RefundIntimationResponse" />
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="IntimationSOAP11HTTPBinding" type="tns:IntimationPort">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="Intimate">
			<soap:operation soapAction="http://www.icicibank.com/api/acme/intimation" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="RefundIntimate">
			<soap:operation soapAction="http://www.icicibank.com/api/acme/refund-intimation" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="IntimationSOAP11WS">
		<wsdl:port binding="tns:IntimationSOAP11HTTPBinding" name="IntimationSOAP11WS">
			<soap:address location="http://www.example.org/" />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>